Repository: xxshubhamxx/cmux-panecho
Catalog: ios/cmux/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, ja, ko, zh_hans, zh_hant

# mobile.workspaceAction.failure.reason.timedOut.generic
source: The request to your Mac timed out.
ar: انتهت مهلة الطلب إلى جهاز Mac الخاص بك.
de: Bei der Anfrage an Ihren Mac ist eine Zeitüberschreitung aufgetreten.
es: Se agotó el tiempo de espera de la solicitud a su Mac.
fr: La requête adressée à votre Mac a expiré.
ja: Mac との通信がタイムアウトしました。
ko: Mac에 대한 요청 시간이 초과되었습니다.
zh_hans: 对 Mac 的请求超时。
zh_hant: 對 Mac 的請求逾時。

# mobile.workspaceAction.failure.reason.authorization.host
source: %@ didn't authorize the request.
ar: لم يسمح %@ بالطلب.
de: %@ hat die Anfrage nicht autorisiert.
es: %@ no autorizó la solicitud.
fr: %@ n'a ​​pas autorisé la demande.
ja: %@ はリクエストを許可しませんでした。
ko: %@가 요청을 승인하지 않았습니다.

# mobile.workspaceAction.failure.reason.authorization.generic
source: Your Mac didn't authorize the request.
ar: جهاز Mac الخاص بك لم يسمح بالطلب.
de: Ihr Mac hat die Anfrage nicht autorisiert.
es: Tu Mac no autorizó la solicitud.
fr: Votre Mac n'a pas autorisé la demande.
ja: Mac はリクエストを許可しませんでした。
ko: Mac이 요청을 승인하지 않았습니다.
zh_hans: 您的 Mac 未授权该请求。
zh_hant: 您的 Mac 未授權該要求。

# mobile.workspaceAction.failure.reason.busy.host
source: %@ is finishing another workspace action.
ar: يقوم %@ بإنهاء إجراء آخر في مساحة العمل.
de: %@ beendet eine weitere Arbeitsbereichsaktion.
es: %@ está finalizando otra acción del espacio de trabajo.
fr: %@ termine une autre action dans l'espace de travail.
ja: %@ が別のワークスペース操作を完了しています。
ko: %@가 다른 작업공간 작업을 완료하는 중입니다.
zh_hans: %@ 正在完成另一个工作区操作。
zh_hant: %@ 正在完成另一個工作區作業。

# mobile.workspaceAction.failure.reason.busy.generic
source: Another workspace action is still finishing.
ar: لا يزال هناك إجراء آخر في مساحة العمل على وشك الانتهاء.
de: Eine weitere Arbeitsbereichsaktion wird noch abgeschlossen.
es: Otra acción del espacio de trabajo aún está finalizando.
fr: Une autre action sur l'espace de travail est en cours de finition.
ja: 別のワークスペース操作がまだ完了していません。
ko: 또 다른 작업공간 작업이 아직 완료 중입니다.
zh_hans: 另一个工作区操作仍在完成。
zh_hant: 另一個工作區操作仍在完成。

# mobile.workspaceAction.failure.reason.rejected.host
source: %@ rejected the request.
ar: رفض %@ الطلب.
de: %@ hat die Anfrage abgelehnt.
es: %@ rechazó la solicitud.
fr: %@ a rejeté la demande.
ja: %@ がリクエストを拒否しました。
ko: %@가 요청을 거부했습니다.

# mobile.workspaceAction.failure.reason.rejected.generic
source: Your Mac rejected the request.
ar: رفض جهاز Mac الخاص بك الطلب.
de: Ihr Mac hat die Anfrage abgelehnt.
es: Tu Mac rechazó la solicitud.
fr: Votre Mac a rejeté la demande.
ja: Mac がリクエストを拒否しました。
ko: Mac에서 요청을 거부했습니다.
zh_hans: 您的 Mac 拒绝了该请求。
zh_hant: 您的 Mac 拒絕了該請求。

# mobile.workspaceAction.failure.reason.invalidWorkingDirectory
source: The working directory isn't available on your Mac; choose another directory.
ar: دليل العمل غير متوفر على جهاز Mac الخاص بك؛ اختر دليلا آخر.
de: Das Arbeitsverzeichnis ist auf Ihrem Mac nicht verfügbar; Wählen Sie ein anderes Verzeichnis.
es: El directorio de trabajo no está disponible en tu Mac; elija otro directorio.
fr: Le répertoire de travail n'est pas disponible sur votre Mac ; choisissez un autre répertoire.
ja: Mac で作業ディレクトリを使用できません。別のディレクトリを選択してください。
ko: Mac에서는 작업 디렉토리를 사용할 수 없습니다. 다른 디렉터리를 선택하세요.
zh_hans: 工作目录在您的 Mac 上不可用；选择另一个目录。
zh_hant: 工作目錄在您的 Mac 上不可用；選擇另一個目錄。

# mobile.workspaceAction.failure.reason.alreadyCompleted
source: Your Mac already accepted the request; refresh workspaces before trying again.
ar: لقد قبل جهاز Mac الخاص بك الطلب بالفعل؛ قم بتحديث مساحات العمل قبل المحاولة مرة أخرى.
de: Ihr Mac hat die Anfrage bereits angenommen; Aktualisieren Sie die Arbeitsbereiche, bevor Sie es erneut versuchen.
es: Tu Mac ya aceptó la solicitud; Actualice los espacios de trabajo antes de volver a intentarlo.
fr: Votre Mac a déjà accepté la demande ; actualisez les espaces de travail avant de réessayer.
ja: Macはリクエストをすでに受け付けています。ワークスペースを更新してから、もう一度お試しください。
ko: Mac에서 이미 요청을 수락했습니다. 다시 시도하기 전에 작업공간을 새로 고치세요.
zh_hans: 您的 Mac 已经接受了请求；请先刷新工作区，然后重试。
zh_hant: 您的 Mac 已經接受了請求；請先刷新工作區，然後再試一次。

# mobile.workspaceAction.failure.reason.persistence
source: Your Mac could not safely reserve the request.
ar: لم يتمكن جهاز Mac الخاص بك من حجز الطلب بأمان.
de: Ihr Mac konnte die Anfrage nicht sicher reservieren.
es: Su Mac no pudo reservar la solicitud de forma segura.
fr: Votre Mac n'a pas pu réserver la demande en toute sécurité.
ja: Macでリクエストを安全に予約できませんでした。
ko: Mac에서 요청을 안전하게 예약할 수 없습니다.
zh_hans: 您的 Mac 无法安全地保留该请求。
zh_hant: 您的 Mac 無法安全地保留該請求。

# mobile.workspaceAction.failure.reason.unsupported.host
source: %@ doesn't support that action.
ar: %@ لا يدعم هذا الإجراء.
de: %@ unterstützt diese Aktion nicht.
es: %@ no admite esa acción.
fr: %@ ne prend pas en charge cette action.
ja: %@ はその操作に対応していません。
ko: %@는 해당 작업을 지원하지 않습니다.

# mobile.workspaceAction.failure.reason.unsupported.generic
source: Your Mac doesn't support that action.
ar: جهاز Mac الخاص بك لا يدعم هذا الإجراء.
de: Ihr Mac unterstützt diese Aktion nicht.
es: Tu Mac no admite esa acción.
fr: Votre Mac ne prend pas en charge cette action.
ja: Mac はその操作に対応していません。
ko: 귀하의 Mac은 해당 작업을 지원하지 않습니다.
zh_hans: 您的 Mac 不支持该操作。
zh_hant: 您的 Mac 不支援該操作。

# mobile.screenshot.notification.body
source: Claude is asking: which database should I use, Postgres or SQLite?
ar: يسأل كلود: ما هي قاعدة البيانات التي يجب أن أستخدمها، Postgres أم SQLite؟
de: Claude fragt: Welche Datenbank soll ich verwenden, Postgres oder SQLite?
es: Claude pregunta: ¿qué base de datos debo usar, Postgres o SQLite?
fr: Claude demande : quelle base de données dois-je utiliser, Postgres ou SQLite ?
ja: Claude が質問しています: どのデータベースを使いますか、Postgres それとも SQLite?
ko: Claude가 묻습니다. Postgres 또는 SQLite 중 어떤 데이터베이스를 사용해야 합니까?
zh_hans: Claude 问：我应该使用哪个数据库，Postgres 还是 SQLite？
zh_hant: Claude 問：我該使用哪個資料庫，Postgres 還是 SQLite？

# mobile.screenshot.notification.reply.action
source: Reply
ar: رد
de: Antworten
es: Responder
fr: Répondre
ja: 返信
ko: 답장
zh_hans: 回复
zh_hant: 回覆

# mobile.screenshot.notification.reply.body
source: Implemented the fix and opened the PR. Ready for your review — reply to continue.
ar: تم تنفيذ الإصلاح وفتح طلب السحب. جاهز للمراجعة. رد للمتابعة.
de: Fix implementiert und PR eröffnet. Bereit für Ihr Review. Antworten Sie, um fortzufahren.
es: Corrección implementada y PR abierta. Lista para tu revisión. Responde para continuar.
fr: Correctif implémenté et PR ouverte. Prête pour votre relecture. Répondez pour continuer.
ja: 修正を実装して PR を作成しました。レビューできます。返信して続行してください。
ko: 수정 사항을 구현하고 PR을 열었습니다. 검토할 준비가 되었습니다. 계속하려면 답장하세요.
zh_hans: 已完成修复并创建 PR。可以审阅了，回复即可继续。
zh_hant: 已完成修正並建立 PR。可以審閱了，回覆即可繼續。

# mobile.screenshot.notification.reply.placeholder
source: Message the agent…
ar: راسل الوكيل…
de: Nachricht an den Agenten …
es: Escribe al agente…
fr: Écrire à l’agent…
ja: エージェントにメッセージ…
ko: 에이전트에게 메시지 보내기…
zh_hans: 给代理发消息…
zh_hant: 傳訊息給代理…

# mobile.screenshot.notification.reply.send
source: Send
ar: إرسال
de: Senden
es: Enviar
fr: Envoyer
ja: 送信
ko: 보내기
zh_hans: 发送
zh_hant: 傳送

# mobile.screenshot.notification.reply.subtitle
source: cmux agent
ar: وكيل cmux
es: Agente de cmux
fr: Agent cmux
ja: cmux エージェント
ko: cmux 에이전트
zh_hans: cmux 代理
zh_hant: cmux 代理

# mobile.screenshot.notification.reply.title
source: Claude finished in workspace ~
ar: أنهى Claude العمل في مساحة العمل ~
de: Claude ist im Arbeitsbereich ~ fertig
es: Claude terminó en el espacio de trabajo ~
fr: Claude a terminé dans l’espace de travail ~
ja: Claude がワークスペース ~ で完了しました
ko: Claude가 작업공간 ~에서 완료했습니다
zh_hans: Claude 已在工作区 ~ 完成
zh_hant: Claude 已在工作區 ~ 完成

# mobile.screenshot.notification.title
source: Agent needs your input
ar: الوكيل يحتاج إلى مدخلاتك
de: Der Agent benötigt Ihren Input
es: El agente necesita su opinión
fr: L'agent a besoin de votre contribution
ja: エージェントが入力を求めています
ko: 상담원에게 귀하의 의견이 필요합니다
zh_hans: 代理需要您的意见
zh_hant: 代理需要您的意見

# mobile.common.actions
source: Actions
ar: الإجراءات
de: Aktionen
es: Comportamiento
fr: Actes
ja: 操作
ko: 행위
zh_hans: 行动
zh_hant: 行動

# mobile.common.remove
source: Remove
ar: يزيل
de: Entfernen
es: Eliminar
fr: Retirer
ja: 削除
ko: 제거하다
zh_hans: 消除
zh_hant: 消除

# mobile.settings.iroh
source: Networking
ar: الشبكات
de: Vernetzung
es: Redes
fr: Réseautage
ja: ネットワーク
ko: 네트워킹
zh_hans: 联网
zh_hant: 聯網

# mobile.settings.networking
source: Networking
ar: الشبكات
de: Vernetzung
es: Redes
fr: Réseautage
ja: ネットワーク
ko: 네트워킹
zh_hans: 联网
zh_hant: 聯網

# mobile.iroh.attention
source: Your relay preference needs attention. cmux is keeping an unselected provider disabled.
ar: يحتاج تفضيل الترحيل الخاص بك إلى الاهتمام. يقوم cmux بتعطيل الموفر غير المحدد.
de: Ihre Relaispräferenz erfordert Aufmerksamkeit. cmux hält einen nicht ausgewählten Anbieter deaktiviert.
es: Su preferencia de relevo necesita atención. cmux mantiene deshabilitado un proveedor no seleccionado.
fr: Votre préférence de relais nécessite une attention particulière. cmux maintient un fournisseur non sélectionné désactivé.
ja: リレー設定を確認してください。cmux は未選択のプロバイダーを無効のまま維持しています。
ko: 릴레이 설정에 주의가 필요합니다. cmux는 선택되지 않은 공급자를 비활성화된 상태로 유지합니다.
zh_hans: 您的中继偏好需要注意。 cmux 正在禁用未选择的提供程序。
zh_hant: 您的中繼偏好需要注意。 cmux 正在停用未選擇的提供者。

# mobile.iroh.custom
source: Custom Relays
ar: المرحلات المخصصة
de: Benutzerdefinierte Relais
es: Relés personalizados
fr: Relais personnalisés
ja: カスタムリレー
ko: 맞춤형 릴레이
zh_hans: 定制继电器
zh_hant: 客製化繼電器

# mobile.iroh.custom.add
source: Add Custom Relay
ar: إضافة تتابع مخصص
de: Benutzerdefiniertes Relais hinzufügen
es: Agregar retransmisión personalizada
fr: Ajouter un relais personnalisé
ja: カスタムリレーを追加
ko: 사용자 정의 릴레이 추가
zh_hans: 添加自定义中继
zh_hant: 新增自訂中繼

# mobile.iroh.custom.authentication
source: Authentication
ar: المصادقة
de: Authentifizierung
es: Autenticación
fr: Authentification
ja: 認証
ko: 입증
zh_hans: 验证
zh_hant: 驗證

# mobile.iroh.custom.authentication.none
source: None
ar: لا أحد
de: Keiner
es: Ninguno
fr: Aucun
ja: なし
ko: 없음
zh_hans: 没有任何
zh_hant: 沒有任何

# mobile.iroh.custom.authentication.secret
source: Device Secret
ar: سر الجهاز
de: Gerätegeheimnis
es: Secreto del dispositivo
fr: Secret de l'appareil
ja: デバイスシークレット
ko: 기기 비밀번호
zh_hans: 设备秘密
zh_hant: 設備秘密

# mobile.iroh.custom.edit
source: Edit Custom Relay
ar: تحرير التتابع المخصص
de: Benutzerdefiniertes Relay bearbeiten
es: Editar retransmisión personalizada
fr: Modifier le relais personnalisé
ja: カスタムリレーを編集
ko: 사용자 정의 릴레이 편집
zh_hans: 编辑自定义中继
zh_hant: 編輯自訂中繼

# mobile.iroh.custom.footer
source: Addresses sync with your account. Provider secrets stay in this device's Keychain. A missing secret never enables another relay provider.
ar: تتم مزامنة العناوين مع حسابك. تبقى أسرار الموفر في Keychain لهذا الجهاز. السر المفقود لا يسمح أبدًا لموفر ترحيل آخر.
de: Adressen werden mit Ihrem Konto synchronisiert. Die Geheimnisse des Anbieters bleiben im Schlüsselbund dieses Geräts. Ein fehlendes Geheimnis aktiviert niemals einen anderen Relay-Anbieter.
es: Las direcciones se sincronizan con su cuenta. Los secretos del proveedor permanecen en el llavero de este dispositivo. Un secreto faltante nunca habilita a otro proveedor de retransmisión.
fr: Les adresses se synchronisent avec votre compte. Les secrets du fournisseur restent dans le trousseau de cet appareil. Un secret manquant n'active jamais un autre fournisseur de relais.
ja: アドレスはアカウントと同期されます。プロバイダーのシークレットはこのデバイスのキーチェーンに保存されます。シークレットがない場合に別のリレープロバイダーが有効になることはありません。
ko: 주소는 귀하의 계정과 동기화됩니다. 공급자 비밀번호는 이 기기의 키체인에 유지됩니다. 누락된 비밀은 다른 릴레이 공급자를 활성화하지 않습니다.
zh_hans: 地址与您的帐户同步。提供商机密保留在此设备的钥匙串中。丢失的秘密永远不会启用另一个中继提供商。
zh_hant: 地址與您的帳戶同步。提供者機密保留在此設備的鑰匙圈中。遺失的秘密永遠不會啟用另一個中繼提供者。

# mobile.iroh.custom.name
source: Name
ar: اسم
es: Nombre
fr: Nom
ja: 名前
ko: 이름
zh_hans: 姓名
zh_hant: 姓名

# mobile.iroh.custom.provider
source: Provider
ar: مزود
de: Anbieter
es: Proveedor
fr: Fournisseur
ja: プロバイダー
ko: 공급자
zh_hans: 提供者
zh_hant: 提供者

# mobile.iroh.custom.region
source: Region
ar: منطقة
es: Región
fr: Région
ja: リージョン
ko: 지역
zh_hans: 地区
zh_hant: 地區

# mobile.iroh.custom.remove.confirm
source: Remove this custom relay?
ar: هل تريد إزالة هذا التتابع المخصص؟
de: Dieses benutzerdefinierte Relais entfernen?
es: ¿Quitar este relé personalizado?
fr: Supprimer ce relais personnalisé ?
ja: このカスタムリレーを削除しますか？
ko: 이 맞춤 릴레이를 삭제하시겠습니까?
zh_hans: 删除这个自定义继电器？
zh_hant: 刪除這個自訂繼電器？

# mobile.iroh.custom.secret
source: Relay Secret
ar: سر التتابع
de: Staffelgeheimnis
es: Secreto de retransmisión
fr: Secret du relais
ja: リレーシークレット
ko: 릴레이 비밀
zh_hans: 中继秘密
zh_hant: 中繼秘密

# mobile.iroh.custom.secret.keep
source: New Secret (optional)
ar: سر جديد (اختياري)
de: Neues Geheimnis (optional)
es: Nuevo secreto (opcional)
fr: Nouveau secret (facultatif)
ja: 新しいシークレット（任意）
ko: 새 비밀번호(선택사항)
zh_hans: 新秘密（可选）
zh_hant: 新秘密（可選）

# mobile.iroh.custom.secret.note
source: Relay secrets stay in this device's Keychain and do not sync with your account.
ar: تبقى أسرار الترحيل في Keychain لهذا الجهاز ولا تتم مزامنتها مع حسابك.
de: Relay-Geheimnisse bleiben im Schlüsselbund dieses Geräts und werden nicht mit Ihrem Konto synchronisiert.
es: Los secretos de retransmisión permanecen en el llavero de este dispositivo y no se sincronizan con su cuenta.
fr: Les secrets du relais restent dans le trousseau de cet appareil et ne sont pas synchronisés avec votre compte.
ja: リレーシークレットはこのデバイスのキーチェーンに保存され、アカウントとは同期されません。
ko: 릴레이 비밀은 이 기기의 키체인에 유지되며 계정과 동기화되지 않습니다.
zh_hans: 中继机密保留在此设备的钥匙串中，不会与您的帐户同步。
zh_hant: 中繼機密保留在此裝置的鑰匙圈中，不會與您的帳戶同步。

# mobile.iroh.custom.url
source: Relay URL
ar: ترحيل URL
es: URL de retransmisión
fr: URL de relais
ja: リレー URL
ko: 릴레이 URL
zh_hans: 中继网址
zh_hant: 中繼網址

# mobile.iroh.debug
source: Debug Verification
ar: التحقق من التصحيح
de: Debug-Überprüfung
es: Verificación de depuración
fr: Vérification du débogage
ja: デバッグ検証
ko: 디버그 검증
zh_hans: 调试验证
zh_hant: 偵錯驗證

# mobile.iroh.debug.footer
source: Changing this restarts Iroh without signing out or changing this app's device identity.
ar: يؤدي تغيير هذا إلى إعادة تشغيل Iroh دون تسجيل الخروج أو تغيير هوية جهاز هذا التطبيق.
de: Wenn Sie dies ändern, wird Iroh neu gestartet, ohne sich abzumelden oder die Geräteidentität dieser App zu ändern.
es: Al cambiar esto, se reinicia Iroh sin cerrar sesión ni cambiar la identidad del dispositivo de esta aplicación.
fr: Changer cela redémarre Iroh sans se déconnecter ni modifier l'identité de l'appareil de cette application.
ja: この設定を変更すると、サインアウトせず、このアプリのデバイス ID を変更せずに Iroh が再起動します。
ko: 이를 변경하면 로그아웃하거나 이 앱의 장치 ID를 변경하지 않고 Iroh가 다시 시작됩니다.
zh_hans: 更改此设置会重新启动 Iroh，而无需注销或更改此应用程序的设备身份。
zh_hant: 變更此設定會重新啟動 Iroh，而無需登出或變更此應用程式的裝置身分。

# mobile.iroh.debug.transportMode
source: Transport Mode
ar: وضع النقل
de: Transportmodus
es: Modo de transporte
fr: Mode de transport
ja: トランスポートモード
ko: 운송 모드
zh_hans: 运输方式
zh_hant: 運輸方式

# mobile.iroh.debug.transportMode.automatic
source: Automatic
ar: تلقائي
de: Automatisch
es: Automático
fr: Automatique
ja: 自動
ko: 오토매틱
zh_hans: 自动的
zh_hant: 自動的

# mobile.iroh.debug.transportMode.directOnly
source: No Relay (Direct Only)
ar: لا يوجد ترحيل (مباشر فقط)
de: Kein Relais (nur direkt)
es: Sin retransmisión (solo directo)
fr: Pas de relais (direct uniquement)
ja: リレーなし（直接接続のみ）
ko: 릴레이 없음(직접 전용)
zh_hans: 无中继（仅限直接）
zh_hant: 無中繼（僅限直接）

# mobile.iroh.debug.transportMode.relayOnly
source: Relay Only
ar: التتابع فقط
de: Nur Relais
es: Sólo relé
fr: Relais uniquement
ja: リレーのみ
ko: 릴레이 전용
zh_hans: 仅中继
zh_hant: 僅中繼

# mobile.iroh.diagnostics
source: Diagnostics
ar: التشخيص
de: Diagnose
es: Diagnóstico
fr: Diagnostic
ja: 診断
ko: 진단
zh_hans: 诊断
zh_hant: 診斷

# mobile.iroh.diagnostics.clear
source: Clear Logs
ar: مسح السجلات
de: Protokolle löschen
es: Borrar registros
fr: Effacer les journaux
ja: ログを消去
ko: 로그 지우기
zh_hans: 清除日志
zh_hant: 清除日誌

# mobile.iroh.diagnostics.clear.confirm
source: Clear this diagnostic report?
ar: هل تريد مسح هذا التقرير التشخيصي؟
de: Diesen Diagnosebericht löschen?
es: ¿Borrar este informe de diagnóstico?
fr: Effacer ce rapport de diagnostic ?
ja: この診断レポートを消去しますか？
ko: 이 진단 보고서를 삭제하시겠습니까?
zh_hans: 清除这份诊断报告吗？
zh_hant: 清除這份診斷報告嗎？

# mobile.iroh.diagnostics.clear.message
source: This permanently removes the connection timeline stored on this device.
ar: يؤدي هذا إلى إزالة المخطط الزمني للاتصال المخزن على هذا الجهاز بشكل دائم.
de: Dadurch wird die auf diesem Gerät gespeicherte Verbindungszeitleiste dauerhaft entfernt.
es: Esto elimina permanentemente la línea de tiempo de conexión almacenada en este dispositivo.
fr: Cela supprime définitivement la chronologie de connexion stockée sur cet appareil.
ja: このデバイスに保存された接続タイムラインを完全に削除します。
ko: 이 장치에 저장된 연결 타임라인이 영구적으로 제거됩니다.
zh_hans: 这将永久删除存储在该设备上的连接时间线。
zh_hant: 這將永久刪除儲存在該裝置上的連接時間軸。

# mobile.iroh.diagnostics.eventCount
source: Recorded Events
ar: الأحداث المسجلة
de: Aufgezeichnete Ereignisse
es: Eventos grabados
fr: Événements enregistrés
ja: 記録済みイベント
ko: 기록된 이벤트
zh_hans: 记录的事件
zh_hant: 記錄的事件

# mobile.iroh.diagnostics.failure.accountMismatch
source: Account Mismatch
ar: عدم تطابق الحساب
de: Kontokonflikt
es: No coincide la cuenta
fr: Incompatibilité de compte
ja: アカウントが一致しません
ko: 계정 불일치
zh_hans: 账户不匹配
zh_hant: 帳戶不符

# mobile.iroh.diagnostics.failure.admissionDenied
source: Connection Admission Denied
ar: تم رفض قبول الاتصال
de: Verbindungszulassung verweigert
es: Admisión de conexión denegada
fr: Admission de connexion refusée
ja: 接続の受け入れが拒否されました
ko: 연결 승인이 거부되었습니다
zh_hans: 连接拒绝
zh_hant: 連線拒絕

# mobile.iroh.diagnostics.failure.admissionLeaseExpired
source: Admission Lease Expired
ar: انتهت صلاحية عقد القبول
de: Zulassungsmiete abgelaufen
es: El contrato de admisión expiró
fr: Bail d'admission expiré
ja: 受け入れリースの期限切れ
ko: 입장권 임대가 만료되었습니다
zh_hans: 入场租约到期
zh_hant: 入場租約到期

# mobile.iroh.diagnostics.failure.admissionRevalidationFailed
source: Admission Revalidation Failed
ar: فشل إعادة التحقق من القبول
de: Verlängerung der Zulassung fehlgeschlagen
es: Revalidación de admisión fallida
fr: Échec de la revalidation de l'admission
ja: 受け入れの再検証に失敗しました
ko: 입학 재검증 실패
zh_hans: 入学重新验证失败
zh_hant: 入學重新驗證失敗

# mobile.iroh.diagnostics.failure.authorizationFailed
source: Authorization Failed
ar: فشل التفويض
de: Autorisierung fehlgeschlagen
es: Autorización fallida
fr: Échec de l'autorisation
ja: 認可に失敗
ko: 승인 실패
zh_hans: 授权失败
zh_hant: 授權失敗

# mobile.iroh.diagnostics.failure.cancelled
source: Cancelled
ar: تم الإلغاء
de: Abgesagt
es: Cancelado
fr: Annulé
ja: キャンセル
ko: 취소
zh_hans: 取消
zh_hant: 取消

# mobile.iroh.diagnostics.failure.connectionClosed
source: Connection Closed
ar: الاتصال مغلق
de: Verbindung geschlossen
es: Conexión cerrada
fr: Connexion fermée
ja: 接続が終了しました
ko: 연결이 종료되었습니다.
zh_hans: 连接关闭
zh_hant: 連線關閉

# mobile.iroh.diagnostics.failure.connectionRefused
source: Connection Refused
ar: رفض اتصال
de: Verbindung abgelehnt
es: Conexión rechazada
fr: Connexion rejetée
ja: 接続が拒否されました
ko: 연결이 거부됨
zh_hans: 连接被拒绝
zh_hant: 連線被拒絕

# mobile.iroh.diagnostics.failure.credentialUnavailable
source: Credentials Unavailable
ar: بيانات الاعتماد غير متوفرة
de: Anmeldeinformationen nicht verfügbar
es: Credenciales no disponibles
fr: Informations d'identification indisponibles
ja: 認証情報を利用できません
ko: 자격 증명을 사용할 수 없습니다.
zh_hans: 凭证不可用
zh_hant: 憑證不可用

# mobile.iroh.diagnostics.failure.dnsFailed
source: Name Resolution Failed
ar: فشل تحليل الاسم
de: Namensauflösung fehlgeschlagen
es: Error en la resolución del nombre
fr: Échec de la résolution du nom
ja: 名前解決に失敗
ko: 이름 확인 실패
zh_hans: 名称解析失败
zh_hant: 名稱解析失敗

# mobile.iroh.diagnostics.failure.endpointUnavailable
source: Endpoint Unavailable
ar: نقطة النهاية غير متاحة
de: Endpunkt nicht verfügbar
es: Punto final no disponible
fr: Point de terminaison indisponible
ja: エンドポイントを利用できません
ko: 엔드포인트를 사용할 수 없음
zh_hans: 端点不可用
zh_hant: 端點不可用

# mobile.iroh.diagnostics.failure.hostUnreachable
source: Host Unreachable
ar: المضيف غير قابل للوصول
de: Host nicht erreichbar
es: Anfitrión inalcanzable
fr: Hôte inaccessible
ja: ホストに到達できません
ko: 호스트에 연결할 수 없음
zh_hans: 主机无法访问
zh_hant: 主機無法存取

# mobile.iroh.diagnostics.failure.identityMismatch
source: Endpoint Identity Mismatch
ar: عدم تطابق هوية نقطة النهاية
de: Nichtübereinstimmung der Endpunktidentität
es: No coincide la identidad del terminal
fr: Incompatibilité d’identité de point de terminaison
ja: エンドポイント ID が一致しません
ko: 엔드포인트 ID 불일치
zh_hans: 端点身份不匹配
zh_hant: 端點身份不匹配

# mobile.iroh.diagnostics.failure.noRoute
source: No Route Available
ar: لا يوجد طريق متاح
de: Keine Route verfügbar
es: No hay ruta disponible
fr: Aucun itinéraire disponible
ja: 利用可能な経路がありません
ko: 이용 가능한 경로 없음
zh_hans: 无可用路线
zh_hant: 無可用路線

# mobile.iroh.diagnostics.failure.none
source: None
ar: لا أحد
de: Keiner
es: Ninguno
fr: Aucun
ja: なし
ko: 없음
zh_hans: 没有任何
zh_hant: 沒有任何

# mobile.iroh.diagnostics.failure.offline
source: Offline
ar: غير متصل
es: Desconectado
fr: Hors ligne
ja: オフライン
ko: 오프라인
zh_hans: 离线
zh_hant: 離線

# mobile.iroh.diagnostics.failure.permissionDenied
source: Permission Denied
ar: تم رفض الإذن
de: Zugriff verweigert
es: Permiso denegado
fr: Autorisation refusée
ja: 権限がありません
ko: 권한이 거부되었습니다
zh_hans: 没有权限
zh_hant: 沒有權限

# mobile.iroh.diagnostics.failure.policyUnavailable
source: Relay Policy Unavailable
ar: سياسة الترحيل غير متاحة
de: Relay-Richtlinie nicht verfügbar
es: Política de retransmisión no disponible
fr: Politique de relais indisponible
ja: リレーポリシーを利用できません
ko: 릴레이 정책을 사용할 수 없음
zh_hans: 中继策略不可用
zh_hant: 中繼策略不可用

# mobile.iroh.diagnostics.failure.payloadTooLarge
source: Payload Too Large
ar: الحمولة كبيرة جدًا
de: Nutzlast zu groß
es: Carga útil demasiado grande
fr: Charge utile trop importante
ja: ペイロードが大きすぎます
ko: 페이로드가 너무 큼
zh_hans: 有效负载太大
zh_hant: 有效負載太大

# mobile.iroh.diagnostics.failure.resourceLimitReached
source: Resource Limit Reached
ar: تم الوصول إلى حد الموارد
de: Ressourcenlimit erreicht
es: Límite de recursos alcanzado
fr: Limite de ressources atteinte
ja: リソース上限に達しました
ko: 리소스 한도에 도달했습니다.
zh_hans: 已达到资源限制
zh_hant: 已達到資源限制

# mobile.iroh.diagnostics.failure.protocolViolation
source: Protocol Error
ar: خطأ في البروتوكول
de: Protokollfehler
es: Error de protocolo
fr: Erreur de protocole
ja: プロトコルエラー
ko: 프로토콜 오류
zh_hans: 协议错误
zh_hant: 協定錯誤

# mobile.iroh.diagnostics.failure.secureChannelFailed
source: Secure Channel Failed
ar: فشل القناة الآمنة
de: Sicherer Kanal fehlgeschlagen
es: Error en el canal seguro
fr: Échec du canal sécurisé
ja: 安全なチャネルの確立に失敗
ko: 보안 채널 실패
zh_hans: 安全通道失败
zh_hant: 安全通道失敗

# mobile.iroh.diagnostics.failure.sendQueueOverflow
source: Send Queue Overflow
ar: إرسال تجاوز قائمة الانتظار
de: Überlauf der Sendewarteschlange
es: Enviar desbordamiento de cola
fr: Débordement de file d'attente d'envoi
ja: 送信キューオーバーフロー
ko: 대기열 오버플로 보내기
zh_hans: 发送队列溢出
zh_hant: 發送隊列溢出

# mobile.iroh.diagnostics.failure.superseded
source: Replaced by a Newer Attempt
ar: تم استبداله بمحاولة أحدث
de: Durch einen neueren Versuch ersetzt
es: Reemplazado por un intento más nuevo
fr: Remplacé par une tentative plus récente
ja: 新しい接続試行に置き換えられました
ko: 새로운 시도로 대체됨
zh_hans: 被更新的尝试取代
zh_hant: 被更新的嘗試取代

# mobile.iroh.diagnostics.failure.timedOut
source: Timed Out
ar: انتهت المهلة
de: Zeitüberschreitung
es: Tiempo de espera agotado
fr: Expiré
ja: タイムアウト
ko: 시간 초과
zh_hans: 超时
zh_hant: 超時

# mobile.iroh.diagnostics.failure.transportIdleTimedOut
source: Transport Idle Timeout
ar: مهلة النقل الخاملة
de: Transport-Leerlauf-Timeout
es: Tiempo de inactividad del transporte
fr: Délai d'inactivité du transport
ja: 接続アイドルタイムアウト
ko: 전송 유휴 시간 초과
zh_hans: 传输空闲超时
zh_hant: 傳輸空閒逾時

# mobile.iroh.diagnostics.failure.unknown
source: Unknown
ar: مجهول
de: Unbekannt
es: Desconocido
fr: Inconnu
ja: 不明
ko: 알려지지 않은
zh_hans: 未知
zh_hant: 未知

# mobile.iroh.diagnostics.failure.unsupportedRoute
source: Unsupported Route
ar: طريق غير مدعوم
de: Nicht unterstützte Route
es: Ruta no admitida
fr: Itinéraire non pris en charge
ja: サポートされていない経路
ko: 지원되지 않는 경로
zh_hans: 不支持的路线
zh_hant: 不支援的路線

# mobile.iroh.diagnostics.lastFailure
source: Last Failure
ar: الفشل الأخير
de: Letzter Fehler
es: último fracaso
fr: Dernier échec
ja: 直近の失敗
ko: 마지막 실패
zh_hans: 最后的失败
zh_hant: 最後的失敗
